# ------------------------------------------------------
# 1. HIGH-PRIORITY TWO-LETTER MAPPING
# ------------------------------------------------------
two_letter_map = {
    #"th": "ث",
    #"sh": "ش",
    #"ph": "ف",

    # New
    "ch": "ش",
    "ou": "o",
    "aa": "ع",
    "kh": "خ",
    # Add more pairs if you want
}

# ------------------------------------------------------
# 2. NORMAL ONE-LETTER MAPPING (lower priority)
# ------------------------------------------------------

# -----------------------------------------
# 1. LETTER MAPPING DICTIONARY
#    (Change it to whatever mapping you want)
# -----------------------------------------
one_letter_map = {
    'b': 'ب', 'c': 'س', 'f': 'ف',
    'j': 'ج', 'k': 'ك', 'l': 'ل',
    'm': 'م', 'p': 'ب', 'r': 'ر',
    'u': '', 'v': 'ف', 'w': 'و', 'x': 'اكس', 
    'y': 'ي', 'z': 'ز',
    '3': 'ع', '7': 'خ', '9': 'ق',

    # Special
    'a': ['ع', 'ا', '', 'ة', 'أ'], 'h': ['ح', 'ه'], 'd': ['ض', 'د'],  
    't': ['ت', 'ط']              , 'i': ['ي', 'إ'], 's': ['س', 'ز'],
    'o': ['و', 'أ', '']          , 'g': ['ق', 'ك', 'ق'], 
    'e': ['ا', '']               , 'q': ['ق', 'ك'], 
    'n': ['ن', ''],
}

# t can be 'ت' 'ط'
# a can be 'ا' 'ع' 'ة' 'أ' or '' 
# h can be 'ح' 'ه'
# d can be 'د' 'ض'

# a,e,i,u,w,e,y